IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MCSPI3_MCSPI3.xml
<module name="MCSPI3_MCSPI3" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="MCSPI3_HL_REV" acronym="MCSPI3_HL_REV" offset="0x0" width="32" description="">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Used to distinguish between old scheme and current" range="31 - 30" rwaccess="RO"/> 
		<bitfield id="RSVD" width="2" begin="29" end="28" resetval="0x0" description="Reserved These bits are initialized to zero, and writes to them are ignored" range="29 - 28" rwaccess="RO"/> 
		<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x48" description="Function indicates a software compatible module family If there is no level of software compatibility a new Func number [and hence REVISION] should be assigned" range="27 - 16" rwaccess="RO"/> 
		<bitfield id="R_RTL" width="5" begin="15" end="11" resetval="0x3" description="RTL Version [R], maintained by IP design owner RTL follows a numbering such as XYRZ which are explained in this table R changes ONLY when: [1] PDS uploads occur which may have been due to spec changes [2] Bug fixes occur [3] Resets to '0' when X or Y changes Design team has an internal 'Z' [customer invisible] number which increments on every drop that happens due to DV and RTL updates Z resets to 0 when R increments" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="X_MAJOR" width="3" begin="10" end="8" resetval="0x2" description="Major Revision [X], maintained by IP specification owner X changes ONLY when: [1] There is a major feature addition An example would be adding Master Mode to Utopia Level2 The Func field [or Class/Type in old PID format] will remain the same X does NOT change due to: [1] Bug fixes [2] Change in feature parameters" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Indicates a special version for a particular device Consequence of use may avoid use of standard Chip Support Library [CSL] / Drivers" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="Y_MINOR" width="6" begin="5" end="0" resetval="0x11" description="Minor Revision [Y], maintained by IP specification owner Y changes ONLY when: [1] Features are scaled [up or down] Flexibility exists in that this feature scalability may either be represented in the Y change or a specific register in the IP that indicates which features are exactly available [2] When feature creeps from Is-Not list to Is list But this may not be the case once it sees silicon; in which case X will change Y does NOT change due to: [1] Bug fixes [2] Typos or clarifications [3] major functional/feature change/addition/deletion Instead these changes may be reflected via R, S, X as applicable Spec owner maintains a customer-invisible number 'S' which changes due to: [1] Typos/clarifications [2] Bug documentation Note that this bug is not due to a spec change but due to implementation Nevertheless, the spec tracks the IP bugs An RTL release [say for silicon PG11] that occurs due to bug fix should document the corresponding spec number [XYS] in its release notes" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="MCSPI3_HL_HWINFO" acronym="MCSPI3_HL_HWINFO" offset="0x4" width="32" description="">
		<bitfield id="RSVD" width="25" begin="31" end="7" resetval="0x0" description="Reserved These bits are initialized to zero, and writes to them are ignored" range="31 - 7" rwaccess="RO"/> 
		<bitfield id="RETMODE" width="1" begin="6" end="6" resetval="0x0" description="This bit field indicates whether the retention mode is supported using the pin PIRFFRET" range="6" rwaccess="RO"/> 
		<bitfield id="FFNBYTE" width="5" begin="5" end="1" resetval="0x4" description="FIFO number of byte generic parameter This register defines the value of FFNBYTE generic parameter, only MSB bits from 8 down to 4 are taken into account" range="5 - 1" rwaccess="RO"/> 
		<bitfield id="USEFIFO" width="1" begin="0" end="0" resetval="0x1" description="Use of a FIFO enable: This bit field indicates if a FIFO is integrated within controller design with its management" range="0" rwaccess="RO"/>
	</register>
	<register id="MCSPI3_HL_SYSCONFIG" acronym="MCSPI3_HL_SYSCONFIG" offset="0x10" width="32" description="">
		<bitfield id="IDLEMODE" width="2" begin="3" end="2" resetval="0x2" description="Configuration of the local target state management mode By definition, target can handle read/write transaction as long as it is out of IDLE state" range="3 - 2" rwaccess="RW"/> 
		<bitfield id="FREEEMU" width="1" begin="1" end="1" resetval="0x0" description="Sensitivity to emulation [debug] suspend input signal" range="1" rwaccess="RW"/> 
		<bitfield id="SOFTRESET" width="1" begin="0" end="0" resetval="0x0" description="Software reset [Optional]" range="0" rwaccess="RW"/>
	</register>
	<register id="MCSPI3_REVISION" acronym="MCSPI3_REVISION" offset="0x100" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Reads returns 0" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="REV" width="8" begin="7" end="0" resetval="0x43" description="IP revision [7:4] Major revision [3:0] Minor revision Examples: 0x10 for 10, 0x21 for 21" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MCSPI3_SYSCONFIG" acronym="MCSPI3_SYSCONFIG" offset="0x110" width="32" description="">
		<bitfield id="RESERVED" width="22" begin="31" end="10" resetval="0x0" description="Reads returns 0" range="31 - 10" rwaccess="RO"/> 
		<bitfield id="CLOCKACTIVITY" width="2" begin="9" end="8" resetval="0x0" description="Clocks activity during wake up mode period" range="9 - 8" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="3" begin="7" end="5" resetval="0x0" description="Reads returns 0" range="7 - 5" rwaccess="RO"/> 
		<bitfield id="SIDLEMODE" width="2" begin="4" end="3" resetval="0x2" description="Power management" range="4 - 3" rwaccess="RW"/> 
		<bitfield id="ENAWAKEUP" width="1" begin="2" end="2" resetval="0x1" description="WakeUp feature control" range="2" rwaccess="RW"/> 
		<bitfield id="SOFTRESET" width="1" begin="1" end="1" resetval="0x0" description="Software reset During reads it always returns 0" range="1" rwaccess="RW"/> 
		<bitfield id="AUTOIDLE" width="1" begin="0" end="0" resetval="0x1" description="Internal OCP Clock gating strategy" range="0" rwaccess="RW"/>
	</register>
	<register id="MCSPI3_SYSSTATUS" acronym="MCSPI3_SYSSTATUS" offset="0x114" width="32" description="">
		<bitfield id="RESERVED" width="31" begin="31" end="1" resetval="0x0" description="Reserved for module specific status information Read returns 0" range="31 - 1" rwaccess="RO"/> 
		<bitfield id="RESETDONE" width="1" begin="0" end="0" resetval="0x1" description="Internal Reset Monitoring" range="0" rwaccess="RO"/>
	</register>
	<register id="MCSPI3_IRQSTATUS" acronym="MCSPI3_IRQSTATUS" offset="0x118" width="32" description="">
		<bitfield id="RESERVED" width="14" begin="31" end="18" resetval="0x0" description="Reads returns 0" range="31 - 18" rwaccess="RO"/> 
		<bitfield id="EOW" width="1" begin="17" end="17" resetval="0x0" description="End of word count event when a channel is enabled using the FIFO buffer and the channel had sent the number of SPI word defined by MCSPI_XFERLEVEL[WCNT]" range="17" rwaccess="RW"/> 
		<bitfield id="WKS" width="1" begin="16" end="16" resetval="0x0" description="Wake Up event in slave mode when an active control signal is detected on the SPIEN line programmed in the field MCSPI_CH0CONF[SPIENSLV]" range="16" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="1" begin="15" end="15" resetval="0x0" description="Reads returns 0" range="15" rwaccess="RO"/> 
		<bitfield id="RX3_FULL" width="1" begin="14" end="14" resetval="0x0" description="Receiver register is full or almost full Only when Channel 3 is enabled" range="14" rwaccess="RW"/> 
		<bitfield id="TX3_UNDERFLOW" width="1" begin="13" end="13" resetval="0x0" description="Transmitter register underflow Only when Channel 3 is enabled The transmitter register is empty [not updated by Host or DMA with new data] before its time slot assignment Exception: No TX_underflow event when no data has been loaded into the transmitter register since channel has been enabled" range="13" rwaccess="RW"/> 
		<bitfield id="TX3_EMPTY" width="1" begin="12" end="12" resetval="0x0" description="Transmitter register is empty or almost empty Note: Enabling the channel automatically rises this event" range="12" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="1" begin="11" end="11" resetval="0x0" description="Reads returns 0" range="11" rwaccess="RO"/> 
		<bitfield id="RX2_FULL" width="1" begin="10" end="10" resetval="0x0" description="Receiver register full or almost full Channel 2" range="10" rwaccess="RW"/> 
		<bitfield id="TX2_UNDERFLOW" width="1" begin="9" end="9" resetval="0x0" description="Transmitter register underflow Channel 2" range="9" rwaccess="RW"/> 
		<bitfield id="TX2_EMPTY" width="1" begin="8" end="8" resetval="0x0" description="Transmitter register empty or almost empty Channel 2" range="8" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="1" begin="7" end="7" resetval="0x0" description="Reads returns 0" range="7" rwaccess="RO"/> 
		<bitfield id="RX1_FULL" width="1" begin="6" end="6" resetval="0x0" description="Receiver register full or almost full Channel 1" range="6" rwaccess="RW"/> 
		<bitfield id="TX1_UNDERFLOW" width="1" begin="5" end="5" resetval="0x0" description="Transmitter register underflow Channel 1" range="5" rwaccess="RW"/> 
		<bitfield id="TX1_EMPTY" width="1" begin="4" end="4" resetval="0x0" description="Transmitter register empty or almost empty Channel 1" range="4" rwaccess="RW"/> 
		<bitfield id="RX0_OVERFLOW" width="1" begin="3" end="3" resetval="0x0" description="Receiver register overflow [slave mode only] Channel 0" range="3" rwaccess="RW"/> 
		<bitfield id="RX0_FULL" width="1" begin="2" end="2" resetval="0x0" description="Receiver register full or almost full Channel 0" range="2" rwaccess="RW"/> 
		<bitfield id="TX0_UNDERFLOW" width="1" begin="1" end="1" resetval="0x0" description="Transmitter register underflow Channel 0" range="1" rwaccess="RW"/> 
		<bitfield id="TX0_EMPTY" width="1" begin="0" end="0" resetval="0x0" description="Transmitter register empty or almost empty Channel 0" range="0" rwaccess="RW"/>
	</register>
	<register id="MCSPI3_IRQENABLE" acronym="MCSPI3_IRQENABLE" offset="0x11C" width="32" description="">
		<bitfield id="RESERVED" width="14" begin="31" end="18" resetval="0x0" description="Reads return 0" range="31 - 18" rwaccess="RO"/> 
		<bitfield id="EOW_ENABLE" width="1" begin="17" end="17" resetval="0x0" description="End of Word count Interrupt Enable" range="17" rwaccess="RW"/> 
		<bitfield id="WKE" width="1" begin="16" end="16" resetval="0x0" description="Wake Up event interrupt Enable in slave mode when an active control signal is detected on the SPIEN line programmed in the field MCSPI_CH0CONF[SPIENSLV]" range="16" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="1" begin="15" end="15" resetval="0x0" description="Reads returns 0" range="15" rwaccess="RO"/> 
		<bitfield id="RX3_FULL_ENABLE" width="1" begin="14" end="14" resetval="0x0" description="Receiver register Full Interrupt Enable Ch 3" range="14" rwaccess="RW"/> 
		<bitfield id="TX3_UNDERFLOW_ENABLE" width="1" begin="13" end="13" resetval="0x0" description="Transmitter register Underflow Interrupt Enable Ch 3" range="13" rwaccess="RW"/> 
		<bitfield id="TX3_EMPTY_ENABLE" width="1" begin="12" end="12" resetval="0x0" description="Transmitter register Empty Interrupt Enable Ch3" range="12" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="1" begin="11" end="11" resetval="0x0" description="Reads return 0" range="11" rwaccess="RO"/> 
		<bitfield id="RX2_FULL_ENABLE" width="1" begin="10" end="10" resetval="0x0" description="Receiver register Full Interrupt Enable Ch 2" range="10" rwaccess="RW"/> 
		<bitfield id="TX2_UNDERFLOW_ENABLE" width="1" begin="9" end="9" resetval="0x0" description="Transmitter register Underflow Interrupt Enable Ch 2" range="9" rwaccess="RW"/> 
		<bitfield id="TX2_EMPTY_ENABLE" width="1" begin="8" end="8" resetval="0x0" description="Transmitter register Empty Interrupt Enable Ch 2" range="8" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="1" begin="7" end="7" resetval="0x0" description="Reads return 0" range="7" rwaccess="RO"/> 
		<bitfield id="RX1_FULL_ENABLE" width="1" begin="6" end="6" resetval="0x0" description="Receiver register Full Interrupt Enable Ch 1" range="6" rwaccess="RW"/> 
		<bitfield id="TX1_UNDERFLOW_ENABLE" width="1" begin="5" end="5" resetval="0x0" description="Transmitter register Underflow Interrupt Enable Ch 1" range="5" rwaccess="RW"/> 
		<bitfield id="TX1_EMPTY_ENABLE" width="1" begin="4" end="4" resetval="0x0" description="Transmitter register Empty Interrupt Enable Ch 1" range="4" rwaccess="RW"/> 
		<bitfield id="RX0_OVERFLOW_ENABLE" width="1" begin="3" end="3" resetval="0x0" description="Receiver register Overflow Interrupt Enable Ch 0" range="3" rwaccess="RW"/> 
		<bitfield id="RX0_FULL_ENABLE" width="1" begin="2" end="2" resetval="0x0" description="Receiver register Full Interrupt Enable Ch 0" range="2" rwaccess="RW"/> 
		<bitfield id="TX0_UNDERFLOW_ENABLE" width="1" begin="1" end="1" resetval="0x0" description="Transmitter register Underflow Interrupt Enable Ch 0" range="1" rwaccess="RW"/> 
		<bitfield id="TX0_EMPTY_ENABLE" width="1" begin="0" end="0" resetval="0x0" description="Transmitter register Empty Interrupt Enable Ch 0" range="0" rwaccess="RW"/>
	</register>
	<register id="MCSPI3_WAKEUPENABLE" acronym="MCSPI3_WAKEUPENABLE" offset="0x120" width="32" description="">
		<bitfield id="RESERVED" width="31" begin="31" end="1" resetval="0x0" description="Reads returns 0" range="31 - 1" rwaccess="RO"/> 
		<bitfield id="WKEN" width="1" begin="0" end="0" resetval="0x0" description="WakeUp functionality in slave mode when an active control signal is detected on the SPIEN line programmed in the field MCSPI_CH0CONF[SPIENSLV]" range="0" rwaccess="RW"/>
	</register>
	<register id="MCSPI3_SYST" acronym="MCSPI3_SYST" offset="0x124" width="32" description="">
		<bitfield id="RESERVED" width="20" begin="31" end="12" resetval="0x0" description="Reads returns 0" range="31 - 12" rwaccess="RO"/> 
		<bitfield id="SSB" width="1" begin="11" end="11" resetval="0x0" description="Set status bit" range="11" rwaccess="RW"/> 
		<bitfield id="SPIENDIR" width="1" begin="10" end="10" resetval="0x0" description="Set the direction of the SPIEN[3:0] lines and SPICLK line" range="10" rwaccess="RW"/> 
		<bitfield id="SPIDATDIR1" width="1" begin="9" end="9" resetval="0x0" description="Set the direction of the SPIDAT[1]" range="9" rwaccess="RW"/> 
		<bitfield id="SPIDATDIR0" width="1" begin="8" end="8" resetval="0x0" description="Set the direction of the SPIDAT[0]" range="8" rwaccess="RW"/> 
		<bitfield id="WAKD" width="1" begin="7" end="7" resetval="0x0" description="SWAKEUP output [signal data value of internal signal to system] The signal is driven high or low according to the value written into this register bit" range="7" rwaccess="RW"/> 
		<bitfield id="SPICLK" width="1" begin="6" end="6" resetval="0x0" description="SPICLK line [signal data value] If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the CLKSPI line [high or low], and a write into this bit has no effect If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the CLKSPI line is driven high or low according to the value written into this register" range="6" rwaccess="RW"/> 
		<bitfield id="SPIDAT_1" width="1" begin="5" end="5" resetval="0x0" description="SPIDAT[1] line [signal data value] If MCSPI_SYST[SPIDATDIR1] = 0 [output mode direction], the SPIDAT[1] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIDATDIR1] = 1 [input mode direction], this bit returns the value on the SPIDAT[1] line [high or low], and a write into this bit has no effect" range="5" rwaccess="RW"/> 
		<bitfield id="SPIDAT_0" width="1" begin="4" end="4" resetval="0x0" description="SPIDAT[0] line [signal data value] If MCSPI_SYST[SPIDATDIR0] = 0 [output mode direction], the SPIDAT[0] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIDATDIR0] = 1 [input mode direction], this bit returns the value on the SPIDAT[0] line [high or low], and a write into this bit has no effect" range="4" rwaccess="RW"/> 
		<bitfield id="SPIEN_3" width="1" begin="3" end="3" resetval="0x0" description="SPIEN[3] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[3] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[3] line [high or low], and a write into this bit has no effect" range="3" rwaccess="RW"/> 
		<bitfield id="SPIEN_2" width="1" begin="2" end="2" resetval="0x0" description="SPIEN[2] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[2] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[2] line [high or low], and a write into this bit has no effect" range="2" rwaccess="RW"/> 
		<bitfield id="SPIEN_1" width="1" begin="1" end="1" resetval="0x0" description="SPIEN[1] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[1] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[1] line [high or low], and a write into this bit has no effect" range="1" rwaccess="RW"/> 
		<bitfield id="SPIEN_0" width="1" begin="0" end="0" resetval="0x0" description="SPIEN[0] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[0] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[0] line [high or low], and a write into this bit has no effect" range="0" rwaccess="RW"/>
	</register>
	<register id="MCSPI3_MODULCTRL" acronym="MCSPI3_MODULCTRL" offset="0x128" width="32" description="">
		<bitfield id="RESERVED" width="23" begin="31" end="9" resetval="0x0" description="Reads returns 0" range="31 - 9" rwaccess="RO"/> 
		<bitfield id="FDAA" width="1" begin="8" end="8" resetval="0x0" description="FIFO DMA Address 256-bit aligned This register is used when a FIFO is managed by the module and DMA connected to the controller provides only 256 bit aligned address If this bit is set the enabled channel which uses the FIFO has its datas managed through MCSPI_DAFTX and MCSPI_DAFRX registers instead of MCSPI_TX[i] and MCSPI_RX[i] registers" range="8" rwaccess="RW"/> 
		<bitfield id="MOA" width="1" begin="7" end="7" resetval="0x0" description="Multiple word ocp access: This register can only be used when a channel is enabled using a FIFO It allows the system to perform multiple SPI word access for a single 32-bit OCP word access This is possible for WL &#60; 16" range="7" rwaccess="RW"/> 
		<bitfield id="INITDLY" width="3" begin="6" end="4" resetval="0x0" description="Initial spi delay for first transfer: This register is an option only available in SINGLE master mode, The controller waits for a delay to transmit the first spi word after channel enabled and corresponding TX register filled This Delay is based on SPI output frequency clock, No clock output provided to the boundary and chip select is not active in 4 pin mode within this period" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="SYSTEM_TEST" width="1" begin="3" end="3" resetval="0x0" description="Enables the system test mode" range="3" rwaccess="RW"/> 
		<bitfield id="MS" width="1" begin="2" end="2" resetval="0x1" description="Master/ Slave" range="2" rwaccess="RW"/> 
		<bitfield id="PIN34" width="1" begin="1" end="1" resetval="0x0" description="Pin mode selection: This register is used to configure the SPI pin mode, in master or slave mode If asserted the controller only use SIMO,SOMI and SPICLK clock pin for spi transfers" range="1" rwaccess="RW"/> 
		<bitfield id="SINGLE" width="1" begin="0" end="0" resetval="0x0" description="Single channel / Multi Channel [master mode only]" range="0" rwaccess="RW"/>
	</register>
