IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MCSPI3_MCSPI3.xml
	<register id="MCSPI3_TX3" acronym="MCSPI3_TX3" offset="0x174" width="32" description="">
		<bitfield id="TDATA" width="32" begin="31" end="0" resetval="0x0" description="Channel 3 Data to transmit" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MCSPI3_RX3" acronym="MCSPI3_RX3" offset="0x178" width="32" description="">
		<bitfield id="RDATA" width="32" begin="31" end="0" resetval="0x0" description="Channel 3 Received Data" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MCSPI3_XFERLEVEL" acronym="MCSPI3_XFERLEVEL" offset="0x17C" width="32" description="">
		<bitfield id="WCNT" width="16" begin="31" end="16" resetval="0x0" description="Spi word counterThis register holds the programmable value of number of SPI word to be transferred on channel which is using the FIFO bufferWhen transfer had started, a read back in this register returns the current SPI word transfer index" range="31 - 16" rwaccess="RW"/> 
		<bitfield id="AFL" width="8" begin="15" end="8" resetval="0x0" description="Buffer Almost Full This register holds the programmable almost full level value used to determine almost full buffer condition If the user wants an interrupt or a DMA read request to be issued during a receive operation when the data buffer holds at least n bytes, then the buffer MCSPI_MODULCTRL[AFL] must be set with n-1The size of this register is defined by the generic parameter FFNBYTE" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="AEL" width="8" begin="7" end="0" resetval="0x0" description="Buffer Almost EmptyThis register holds the programmable almost empty level value used to determine almost empty buffer condition If the user wants an interrupt or a DMA write request to be issued during a transmit operation when the data buffer is able to receive n bytes, then the buffer MCSPI_MODULCTRL[AEL] must be set with n-1" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="MCSPI3_DAFTX" acronym="MCSPI3_DAFTX" offset="0x180" width="32" description="">
		<bitfield id="DAFTDATA" width="32" begin="31" end="0" resetval="0x0" description="FIFO Data to transmit with DMA 256 bit aligned address This Register is only is used when MCSPI_MODULCTRL[FDAA] is set to '1' and only one of the MCSPI_CH[i]CONF[FFEW] of enabled channels is set If these conditions are not respected any access to this register return a null value" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MCSPI3_DAFRX" acronym="MCSPI3_DAFRX" offset="0x1A0" width="32" description="">
		<bitfield id="DAFRDATA" width="32" begin="31" end="0" resetval="0x0" description="FIFO Data to transmit with DMA 256 bit aligned address This Register is only is used when MCSPI_MODULCTRL[FDAA] is set to '1' and only one of the MCSPI_CH[i]CONF[FFEW] of enabled channels is set If these conditions are not respected any access to this register return a null value" range="31 - 0" rwaccess="RO"/>
	</register>
</module>